# ДЗ 3.2. Перемістити елемент у списку
# Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку
# має стати першим. Послідовність інших елементів не має змінюватися.
# Порожній список або список з одним елементом повинен залишитися незмінним.
# Кількість елементів у списку може бути будь-яким – нуль та більше!

lst1 = [13, 4, 5, 11]
print('Перший список:', lst1)

lst1.insert(0, lst1.pop())
print('Перший список після маніпуляцій:', lst1)

lst2 = [2]
print('Другий список:', lst2)

lst2.insert(0, lst2.pop())
print('Другий список після маніпуляцій:', lst2)

lst3 = []
print('Третій список:', lst3)

if lst3:
    lst3.insert(0, lst3.pop())
    print('Третій список після маніпуляцій:', lst3)
else:
    print('В третьому списку відсутні елементи для переміщення. Тому я виводжу його у початковому вигляді: ', lst3)

lst4 = [13, 4, 5, 11, 9]
print('Четвертий список;', lst4)

lst4.insert(0, lst4.pop())
print('Четвертий список після маніпуляцій:', lst4)
