# ДЗ 4.2. Знайти суму елементів із парними індексами
# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
# потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.

user_list = [0, 1, 8, 9, 2, 5, 4, 2, 10]

result = ""
sum_even_index = ""

if len(user_list) == 0:
    result = 0
    print("Вхідний масив порожній:", result)

else:
    print("Вхідний масив: ", user_list)
    print("Елементи з парними індексами: ", user_list[::2])
    
    sum_even_index = 0

    for i in range(0, len(user_list), 2):
        sum_even_index += user_list[i]
    result = sum_even_index * user_list[-1]

    print("Сума елементів із парними індексами:", sum_even_index)
    print("Останній елемент вхідного масиву:", user_list[-1])
    print("Кінцевий результат обчислень:", result)
