# ДЗ 11.3. Перевірка на парність.
# Завдання ускладнюється.
# Ваша функція is_even, як і раніше, повинна повертати True якщо число парне, або False якщо число непарне,
# але при цьому НЕ МОЖНА використовувати ділення у функції, та дії пов'язані з ним.
# Тобто. заборонено використовувати /, //, % та divmod
# Складність ще полягає і в тому, щоб знайти рішення, яке не залежало б від розміру числа :)
# Вхідні дані: Ціле число.
# Вихідні дані: True або False

import re

def is_even(number):
    return bool(re.match(r'.*[02468]$', str(number)))


assert is_even(2494563894038**2) == True, 'Тест1'
print('Test1: OK')
assert is_even(1056897**2) == False, 'Тест2'
print('Test2: OK')
assert is_even(24945638940387**3) == False, 'Тест3'
print('Test3: OK')